{
  "_name_or_path": "allenai/scibert_scivocab_uncased",
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "control_pce",
    "2": "control_pce_average",
    "3": "control_pce_peak",
    "4": "control_voc",
    "5": "control_voc_peak",
    "6": "date_published",
    "7": "efficiency_cont",
    "8": "efficiency_tret",
    "9": "electron_transport_layer",
    "10": "hole_transport_layer",
    "11": "humidity",
    "12": "journal_publication",
    "13": "passivating_molecule",
    "14": "perovskite_composition",
    "15": "perovskite_molecule",
    "16": "structure_pin_nip",
    "17": "temperature",
    "18": "time",
    "19": "treated_pce",
    "20": "treated_pce_average",
    "21": "treated_pce_peak",
    "22": "treated_voc",
    "23": "treated_voc_peak"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "O": 0,
    "control_pce": 1,
    "control_pce_average": 2,
    "control_pce_peak": 3,
    "control_voc": 4,
    "control_voc_peak": 5,
    "date_published": 6,
    "efficiency_cont": 7,
    "efficiency_tret": 8,
    "electron_transport_layer": 9,
    "hole_transport_layer": 10,
    "humidity": 11,
    "journal_publication": 12,
    "passivating_molecule": 13,
    "perovskite_composition": 14,
    "perovskite_molecule": 15,
    "structure_pin_nip": 16,
    "temperature": 17,
    "time": 18,
    "treated_pce": 19,
    "treated_pce_average": 20,
    "treated_pce_peak": 21,
    "treated_voc": 22,
    "treated_voc_peak": 23
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "torch_dtype": "float32",
  "transformers_version": "4.44.2",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 31090
}
